Repository: elysium-studio/Glance
Catalog: Glance.ThemeSwitcher.WinUI/Strings/*/Resources.resw
Source language: en
Languages: de, es, fr, it, ja, ko, nl, pl, pt_br, zh_hans

# ModuleDisplayName
source: Theme switcher
de: Designumschalter
es: Cambio de tema
fr: Sélecteur de thème
it: Cambio tema
ja: テーマ切り替え
ko: 테마 전환
nl: Themawisselaar
pl: Przełącznik motywu
pt_br: Seletor de tema
zh_hans: 主题切换器

# ModuleDescription
source: Switch Windows between light, dark, or sunset-aware themes.
de: Windows zwischen hellem, dunklem und sonnenuntergangsabhängigem Design umschalten.
es: Cambia Windows entre temas claro, oscuro o según la puesta de sol.
fr: Bascule Windows entre les thèmes clair, sombre ou adapté au coucher du soleil.
it: Passa Windows tra tema chiaro, scuro o basato sul tramonto.
ja: Windows をライト、ダーク、または日没連動テーマに切り替えます。
ko: Windows를 밝게, 어둡게 또는 일몰에 맞춰 전환합니다.
nl: Schakel Windows tussen licht, donker of een zonsondergangschema.
pl: Przełączaj system Windows między jasnym, ciemnym lub zależnym od zachodu słońca motywem.
pt_br: Alterne o Windows entre tema claro, escuro ou baseado no pôr do sol.
zh_hans: 在浅色、深色或日落感知主题之间切换 Windows。

# LightStatus
source: Light mode
de: Heller Modus
es: Modo claro
fr: Mode clair
it: Modalità chiara
ja: ライト モード
ko: 라이트 모드
nl: Lichte modus
pl: Tryb jasny
pt_br: Modo claro
zh_hans: 浅色模式

# DarkStatus
source: Dark mode
de: Dunkler Modus
es: Modo oscuro
fr: Mode sombre
it: Modalità scura
ja: ダーク モード
ko: 다크 모드
nl: Donkere modus
pl: Tryb ciemny
pt_br: Modo escuro
zh_hans: 深色模式

# AutomaticStatus
source: Sunset schedule
de: Sonnenuntergangszeitplan
es: Horario de puesta de sol
fr: Programme du coucher du soleil
it: Programma tramonto
ja: 日没スケジュール
ko: 일몰 일정
nl: Zonsondergangschema
pl: Harmonogram zachodu słońca
pt_br: Agenda do pôr do sol
zh_hans: 日落计划

# ManualDetail
source: Stays this way until changed
de: Bleibt bis zur nächsten Änderung aktiv
es: Se mantiene así hasta que lo cambies
fr: Reste ainsi jusqu’au prochain changement
it: Resta così fino alla prossima modifica
ja: 変更するまでこの状態を維持します
ko: 변경할 때까지 유지됩니다
nl: Blijft zo totdat je het wijzigt
pl: Pozostaje tak do następnej zmiany
pt_br: Permanece assim até você alterar
zh_hans: 保持此状态，直到再次更改

# UntilSunsetDetail
source: Dark at {0}
de: Dunkel um {0}
es: Oscuro a las {0}
fr: Sombre à {0}
it: Scuro alle {0}
ja: {0} にダーク
ko: {0}에 어둡게
nl: Donker om {0}
pl: Ciemny o {0}
pt_br: Escuro às {0}
zh_hans: {0} 切换为深色

# UntilSunriseDetail
source: Light at {0}
de: Hell um {0}
es: Claro a las {0}
fr: Clair à {0}
it: Chiaro alle {0}
ja: {0} にライト
ko: {0}에 밝게
nl: Licht om {0}
pl: Jasny o {0}
pt_br: Claro às {0}
zh_hans: {0} 切换为浅色

# LightLabel
source: Light
de: Hell
es: Claro
fr: Clair
it: Chiaro
ja: ライト
ko: 밝게
nl: Licht
pl: Jasny
pt_br: Claro
zh_hans: 浅色

# SunsetLabel
source: Sunset
de: Sonnenuntergang
es: Puesta de sol
fr: Coucher du soleil
it: Tramonto
ja: 日没
ko: 일몰
nl: Zonsondergang
pl: Zachód słońca
pt_br: Pôr do sol
zh_hans: 日落

# DarkLabel
source: Dark
de: Dunkel
es: Oscuro
fr: Sombre
it: Scuro
ja: ダーク
ko: 어둡게
nl: Donker
pl: Ciemny
pt_br: Escuro
zh_hans: 深色

# LocationRequired
source: Choose Sunset to allow location access
de: Sonnenuntergang wählen, um den Standortzugriff zu erlauben
es: Elige Puesta de sol para permitir el acceso a la ubicación
fr: Choisissez Coucher du soleil pour autoriser la localisation
it: Scegli Tramonto per consentire l’accesso alla posizione
ja: 日没を選択して位置情報へのアクセスを許可してください
ko: 일몰을 선택하여 위치 액세스를 허용하세요
nl: Kies Zonsondergang om locatietoegang toe te staan
pl: Wybierz Zachód słońca, aby zezwolić na dostęp do lokalizacji
pt_br: Escolha Pôr do sol para permitir acesso à localização
zh_hans: 选择“日落”以允许访问位置

# LocationDenied
source: Location access is needed for sunset mode
de: Für den Sonnenuntergangsmodus ist Standortzugriff erforderlich
es: El modo puesta de sol necesita acceso a la ubicación
fr: La localisation est nécessaire pour ce mode
it: La modalità tramonto richiede l’accesso alla posizione
ja: 日没モードには位置情報へのアクセスが必要です
ko: 일몰 모드에는 위치 액세스가 필요합니다
nl: Locatietoegang is nodig voor de zonsondergangmodus
pl: Tryb zachodu słońca wymaga dostępu do lokalizacji
pt_br: O modo pôr do sol precisa de acesso à localização
zh_hans: 日落模式需要位置访问权限

# SunsetUnavailable
source: Sunrise and sunset are unavailable here today
de: Sonnenaufgang und Sonnenuntergang sind hier heute nicht verfügbar
es: Hoy no hay datos de amanecer y puesta de sol para esta ubicación
fr: Le lever et le coucher du soleil sont indisponibles ici aujourd’hui
it: Alba e tramonto non sono disponibili qui oggi
ja: 今日はこの場所の日の出と日没を利用できません
ko: 오늘은 이 위치의 일출과 일몰을 사용할 수 없습니다
nl: Zonsopgang en zonsondergang zijn hier vandaag niet beschikbaar
pl: Dane wschodu i zachodu słońca są tu dziś niedostępne
pt_br: Nascer e pôr do sol não estão disponíveis aqui hoje
zh_hans: 今天无法获取此位置的日出和日落时间

# ThemeChangeFailed
source: Couldn't change the Windows theme
de: Das Windows-Design konnte nicht geändert werden
es: No se pudo cambiar el tema de Windows
fr: Impossible de modifier le thème Windows
it: Impossibile cambiare il tema di Windows
ja: Windows テーマを変更できませんでした
ko: Windows 테마를 변경하지 못했습니다
nl: Het Windows-thema kon niet worden gewijzigd
pl: Nie udało się zmienić motywu systemu Windows
pt_br: Não foi possível alterar o tema do Windows
zh_hans: 无法更改 Windows 主题
